Pandas

In [3]:
import pandas as pd

Series

In [5]:
data = [1,2,3,4,5]
series = pd.Series(data)
print("Series:\n",series)
print(type(series))

Series:
 0    1
1    2
2    3
3    4
4    5
dtype: int64
<class 'pandas.core.series.Series'>

In [8]:
#create a series from dictionary
data = {'a':1,'b':2,'c':3,'d':4}
series= pd.Series(data)
print(series)
print(type(series))

a    1
b    2
c    3
d    4
dtype: int64
<class 'pandas.core.series.Series'>

In [11]:
data=[10,20,30]
index=['a','b','c']
pd.Series(data,index=index)

a    10
b    20
c    30
dtype: int64

Dataframe

In [14]:
#create a Dataframe from a dictionary
data= {
    'Name':['Ali','Tom','Anu'],
    'Age':[20,25,30],
    'city':['malappuram','vengara','chemmad']
}
df=pd.DataFrame(data)

print(df)
print(type(df))

  Name  Age        city
0  Ali   20  malappuram
1  Tom   25     vengara
2  Anu   30     chemmad
<class 'pandas.core.frame.DataFrame'>

In [15]:
import numpy as np
np.array(df)

array([['Ali', 20, 'malappuram'],
       ['Tom', 25, 'vengara'],
       ['Anu', 30, 'chemmad']], dtype=object)

In [18]:
# create a dataframe from a list of dictionary
data = [
    {'Name':'Ali','Age':20,'City':'malappuram'},
    {'Name':'Tom','Age':25,'City':'vengara'},
    {'Name':'Anu','Age':30,'City':'chemmad'}
]
df=pd.DataFrame(data)
print(df)
print(type(df))

  Name  Age        City
0  Ali   20  malappuram
1  Tom   25     vengara
2  Anu   30     chemmad
<class 'pandas.core.frame.DataFrame'>

In [20]:
# Accessing Data from Dataframe
df

  Name  Age        City
0  Ali   20  malappuram
1  Tom   25     vengara
2  Anu   30     chemmad

In [22]:
df['Name']

0    Ali
1    Tom
2    Anu
Name: Name, dtype: object

In [24]:
df.loc[1]

Name        Tom
Age          25
City    vengara
Name: 1, dtype: object

In [ ]:
df.iloc[0]

/var/folders/1t/qqtm35950b74y6zwph6yt5vm0000gn/T/ipykernel_10971/2900375399.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  df.iloc[0][0]

'Ali'

In [28]:
df.iloc[0][2]

/var/folders/1t/qqtm35950b74y6zwph6yt5vm0000gn/T/ipykernel_10971/42695711.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  df.iloc[0][2]

'malappuram'

In [29]:
#Accessing a specified elements
df.at[1,'City']

'vengara'

In [31]:
#Accessing a specified elements using iat
df.iat[2,0]

'Anu'

In [32]:
#Data manipulation with Dataframe
df

  Name  Age        City
0  Ali   20  malappuram
1  Tom   25     vengara
2  Anu   30     chemmad

In [43]:
#Adding a column
df['Salary']=[5000,6000,7000]
df

  Name  Age        City  Salary
0  Ali   20  malappuram    5000
1  Tom   25     vengara    6000
2  Anu   30     chemmad    7000

In [49]:
df.head(1)

  Name  Age        City
0  Ali   21  malappuram

In [50]:
df.tail(1)

  Name  Age     City
2  Anu   31  chemmad

In [44]:
#Remove a column
df.drop('Salary',axis=1,inplace=True)

In [42]:
df

  Name  Age        City
0  Ali   20  malappuram
1  Tom   25     vengara
2  Anu   30     chemmad

In [46]:
#Add age to the column
df['Age']=df['Age']+1

In [47]:
df

  Name  Age        City
0  Ali   21  malappuram
1  Tom   26     vengara
2  Anu   31     chemmad

In [48]:
df.drop(0)

  Name  Age     City
1  Tom   26  vengara
2  Anu   31  chemmad

In [51]:
df.describe()

        Age
count   3.0
mean   26.0
std     5.0
min    21.0
25%    23.5
50%    26.0
75%    28.5
max    31.0